src/Documents/Продажа/Продажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажа</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.КартыУчастников</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.КартыУчастников</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Продажа/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	

	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТипЗнч(ТекСтрокаТовары.Номенклатура) 	= Тип("СправочникСсылка.КартыУчастников") И
			 ТекСтрокаТовары.Номенклатура.Владелец 	= Справочники.Участники.нулевой		Тогда
			ПараметрыКарты = новый Структура;
			ПараметрыКарты.Вставить("Владелец", Участник);
			ПараметрыКарты.Вставить("Участник", Участник);
			СП_РаботаСоСправочниками.ОбновитьКартуУчастника(ТекСтрокаТовары.Номенклатура,ПараметрыКарты);
		КонецЕсли;	
		
		Движение 				= Движения.Продажи.Добавить();
		Движение.Период 		= Дата;
		Движение.Участник 		= Участник;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.количество		= ТекСтрокаТовары.Количество;
		Движение.Стоимость 		= ТекСтрокаТовары.Сумма;
	КонецЦикла;
КонецПроцедуры


Процедура ДобавитьТовар(Номенклатура) Экспорт
	новыйТовар	= Товары.Добавить();	
	новыйТовар.Номенклатура	= Номенклатура;
	новыйТовар.Количество	= 1;
	новыйТовар.Цена			= Номенклатура.Цена;
	новыйТовар.Сумма		= новыйТовар.Количество * новыйТовар.Цена;
КонецПроцедуры
